# 과제를 하면서 얻은 교훈 먼저 선빵, 그리고 데이터 첨부함.

1. summary에 대하여
아래와 같이 네 가지 모델에 대해서 summary를 해본 결과, Connected to를 보는 것이 중요하다는 교훈을 얻었다.
즉, 내가 원하는 방식으로 위아래가 잘 연결되어 있는지 확인시켜줄 수 있는 거 같다.

특히 변수 설정하는 문장 같이 오른쪽에서 왼쪽으로 읽는 게 더 효율적인 거 같다. (일본어 읽는 방식)
a = 5 라는 문장은 오른쪽에서부터 "5라는 값을 변수 a에 저장해라"라고 읽듯이, 
summary 표도 "출발하는 레이어가 어디인데 (Connected to) 이거랑 계산해보니 요 정도이고 (Param #)
만들어내는 출력이 어떤 모양이더라(Output shape), 그걸 담당하는 게 이 레이어야 (layer)"
신기하게도 오른쪽부터 읽으니 참 편하다.
바로 눈에 들어오지 않으면 옆에 공책 놔두고 그리면서 파악하면 좋을 듯하다.
아니면 graphic 자동으로 그려주는 것도 있던데, 나중에 배우지 않을까 싶다.

1-1. Connected to에 대하여
layer_name[x][y]
1. layer_name corresponds to the layer where the input tensors of this layer comes from
2. x : node index
3. y : tensor index

For better understanding, please refer to an examplary source code file "Summary_Connected_to.py"

2. name 파라미터에 대하여
레이어에 name="layer_name" 이렇게 값을 지정해주면 summary에 잘 반영되는 걸 확인할 수 있었다.
그리고 어떤 한 모델에서 같은 name을 지정하면 오류가 뜨는 것도 확인했다.
각 레이어는 고유한 이름을 가져야 한다. (if not, 충돌 발생 -> 오류 발생)


=====이하 데이터=====

1. ensemble 1에 대한 summary (x:y = 2:2)

Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
model2_input (InputLayer)       [(None, 3)]          0
__________________________________________________________________________________________________
model1_input (InputLayer)       [(None, 3)]          0
__________________________________________________________________________________________________
model2_layer1 (Dense)           (None, 10)           40          model2_input[0][0]
__________________________________________________________________________________________________
model1_layer1 (Dense)           (None, 11)           44          model1_input[0][0]
__________________________________________________________________________________________________
model2_layer2 (Dense)           (None, 4)            44          model2_layer1[0][0]
__________________________________________________________________________________________________
model1_layer2 (Dense)           (None, 6)            72          model1_layer1[0][0]
__________________________________________________________________________________________________
model2_layer3 (Dense)           (None, 3)            15          model2_layer2[0][0]
__________________________________________________________________________________________________
cat_start (Concatenate)         (None, 9)            0           model1_layer2[0][0]
                                                                 model2_layer3[0][0]
__________________________________________________________________________________________________
cat_layer1 (Dense)              (None, 15)           150         cat_start[0][0]
__________________________________________________________________________________________________
cat_layer2 (Dense)              (None, 10)           160         cat_layer1[0][0]
__________________________________________________________________________________________________
cat_layer3 (Dense)              (None, 12)           132         cat_layer2[0][0]
__________________________________________________________________________________________________
out2_layer1 (Dense)             (None, 15)           195         cat_layer3[0][0]
__________________________________________________________________________________________________
out1_layer1 (Dense)             (None, 30)           390         cat_layer3[0][0]
__________________________________________________________________________________________________
out2_layer2 (Dense)             (None, 7)            112         out2_layer1[0][0]
__________________________________________________________________________________________________
out1_layer2 (Dense)             (None, 7)            217         out1_layer1[0][0]
__________________________________________________________________________________________________
out2_layer3 (Dense)             (None, 9)            72          out2_layer2[0][0]
__________________________________________________________________________________________________
out1_layer3 (Dense)             (None, 3)            24          out1_layer2[0][0]
__________________________________________________________________________________________________
out2_layer4 (Dense)             (None, 3)            30          out2_layer3[0][0]
==================================================================================================
Total params: 1,697
Trainable params: 1,697
Non-trainable params: 0
__________________________________________________________________________________________________

2. ensemble 2에 대한 summary (x:y = 2:1)
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_2 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           40          input_2[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           40          input_1[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 5)            55          dense_2[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 5)            55          dense[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 5)            30          dense_3[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 10)           0           dense_1[0][0]
                                                                 dense_4[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 30)           330         concatenate[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 7)            217         dense_5[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 3)            24          dense_6[0][0]
==================================================================================================
Total params: 791
Trainable params: 791
Non-trainable params: 0
__________________________________________________________________________________________________

3. ensemble 3에 대한 summary (x:y = 2:3)

Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_2 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           40          input_2[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           40          input_1[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 5)            55          dense_2[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 5)            55          dense[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 5)            30          dense_3[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 10)           0           dense_1[0][0]
                                                                 dense_4[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 30)           330         concatenate[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 10)           310         dense_5[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 10)           110         dense_6[0][0]
__________________________________________________________________________________________________
out2_layer1 (Dense)             (None, 15)           165         dense_7[0][0]
__________________________________________________________________________________________________
out1_layer1 (Dense)             (None, 30)           330         dense_7[0][0]
__________________________________________________________________________________________________
out2_layer2 (Dense)             (None, 7)            112         out2_layer1[0][0]
__________________________________________________________________________________________________
out1_layer2 (Dense)             (None, 7)            217         out1_layer1[0][0]
__________________________________________________________________________________________________
out2_layer3 (Dense)             (None, 7)            56          out2_layer2[0][0]
__________________________________________________________________________________________________
out3_layer1 (Dense)             (None, 10)           110         dense_7[0][0]
__________________________________________________________________________________________________
out1_layer3 (Dense)             (None, 3)            24          out1_layer2[0][0]
__________________________________________________________________________________________________
out2_layer4 (Dense)             (None, 3)            24          out2_layer3[0][0]
__________________________________________________________________________________________________
out3_layer2 (Dense)             (None, 3)            33          out3_layer1[0][0]
==================================================================================================
Total params: 2,041
Trainable params: 2,041
Non-trainable params: 0
__________________________________________________________________________________________________

4. ensemble 4에 대한 summary (x: y = 1:2)

Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           40          input_1[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           110         dense[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           110         dense_1[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 10)           110         dense_2[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 30)           330         dense_3[0][0]
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 15)           165         dense_3[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 30)           930         dense_4[0][0]
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 30)           480         dense_8[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 30)           930         dense_5[0][0]
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 30)           930         dense_9[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 3)            93          dense_6[0][0]
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 3)            93          dense_10[0][0]
==================================================================================================
Total params: 4,321
Trainable params: 4,321
Non-trainable params: 0
__________________________________________________________________________________________________



